TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/Начало/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, ДополнительныеПараметры) Экспорт
	
	
	
	Преф_ШК = Лев(ПолученныйШтрихкод,8);
	
	Если Преф_ШК = "attcontl" Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("КлючОткрытия","attcontl");
		ПараметрыОткрытия.Вставить("СтрокаДоступа",ПолученныйШтрихкод);
		ОткрытьФорму("Обработка.ПанельМеню.Форма.КонтрольДоступа",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученнуюПоШтрихкодуНоменклатуру(НоменклатураПоШтрихкоду, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() Тогда
		
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(НоменклатураПоШтрихкоду);
		
		ПродажиКлиент.СоздатьЧек(МассивНоменклатуры, ДополнительныеПараметры, Истина);
		
		АкцизныеМарки.Очистить();
		
	Иначе
		
		ПулТоваров.Добавить(НоменклатураПоШтрихкоду);
		
		Если ЗначениеЗаполнено(НоменклатураПоШтрихкоду.АкцизныеМарки) Тогда
			ВведенныеАкцизныеМарки = ПолучитьИзВременногоХранилища(НоменклатураПоШтрихкоду.АкцизныеМарки);
			
			Для Каждого ВведеннаяМарка Из ВведенныеАкцизныеМарки Цикл
				
				АкцизныеМарки.Добавить(ВведеннаяМарка, ВведеннаяМарка);
			КонецЦикла;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ВременноеЗакрытиеДиалога") И ДополнительныеПараметры.ВременноеЗакрытиеДиалога Тогда
			ДополнительныеПараметры.ВременноеЗакрытиеДиалога = Ложь;
			ОткрытьДиалогВводаШтрихкода(ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ВременноеЗакрытиеДиалога") И ДополнительныеПараметры.ВременноеЗакрытиеДиалога Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ПотоковоеСканирование") И ПулТоваров.Количество() > 0 Тогда
		
		ПродажиКлиент.СоздатьЧек(ПулТоваров.ВыгрузитьЗначения(), ДополнительныеПараметры, Истина);
		
		ПулТоваров.Очистить();
		АкцизныеМарки.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция АдресМарокЧекаВХранилище() Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(АкцизныеМарки.ВыгрузитьЗначения(), УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	АкцизныеМарки = Новый Массив;
	
	НастроитьОформлениеПолей();
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	ОткрыватьЧтоНового = ПараметрыСеанса.ОткрыватьЧтоНового;
	ОбновлениеБД = ПараметрыСеанса.ОбновлениеБД;
	
//	ОбновитьИнформациюПоКассовойСмене();
	
	// Демоверсия
	НастроитьФормуДляДемоверсии();
	
	ОпределитьТекущегоКассира();
	
	ОбновитьВиджеты();
	
	Элементы.ВиджетЗаказыСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Пролистывание;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" ИЛИ ИмяСобытия = "ВыполненОбмен" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		ОбновитьВиджеты();
		ОбщегоНазначенияКлиент.УстановитьРасширенныйЗаголовокПриложения();
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();   
		ОбщегоНазначенияКлиент.УстановитьРасширенныйЗаголовокПриложения();
	ИначеЕсли ИмяСобытия = "ОбновленоМестоположение" Тогда
		
		ОпределитьМестоположение();
		
	ИначеЕсли ИмяСобытия = "ИнициализированАсинхронныйСканер" Тогда
		
		НастроитьЭлементыАсинхронногоСканера();
		
	ИначеЕсли ИмяСобытия = "ЗаписанЗаказ" Тогда
		
		ОбновитьВиджетЗаказы();
	ИначеЕсли ИмяСобытия = "ПроверитьЗадачи" ИЛИ ИмяСобытия = "ОбновитьЗадания" Тогда
		ПолучитьКоличествоЗадачСервер();
		
	КонецЕсли;
	
	//Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
	//	
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	//	ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	//	
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗапуститьПродолжитьОчередьПроцедурПослеОткрытия();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СообщениеРежимСинхронизацииНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.РежимСинхронизации", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПараметрыУчетаНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыУчета", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПараметрыСинхронизацииНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыСинхронизации", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДемоверсияНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.Демоверсия",, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗадачиНажатие(Элемент)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОткрытия","Задание");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеЗадачиИННажатие(Элемент)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОткрытия","ЗаданиеИН");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеВерификацияНажатие(Элемент)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОткрытия","ЗаданиеВФ");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеТБДНажатие(Элемент)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОткрытия","ЗаданиеТБД");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеТНПНажатие(Элемент)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОткрытия","ЗаданиеТНП");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры      
&НаКлиенте
Процедура ДекорацияПроверкаСтандартовНажатие(Элемент)
	ПараметрыФормы = Новый Структура("ТипДокумента,КлючОткрытия", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов"),"Стандарты");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыФормы , ЭтаФорма);
КонецПроцедуры



&НаКлиенте
Процедура СообщениеНезаполненныеПараметрыУчетаЕГАИСНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыУчета", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеУстройствоПечатиНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеУстройствоПечати", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеНеЗаполненЗаводскойНомерККМНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеУстройствоПечати", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКассирНажатие(Элемент)
	
	Если ЗначениеЗаполнено(КассоваяСмена) Тогда
		
		ОчиститьСообщения();
		
		ТекстСообщения = НСтр("ru = 'Изменение кассира невозможно. Необходимо закрыть кассовую смену.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОповещениеВыборКассира", ЭтотОбъект);
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПредупреждениеНажатие(Элемент)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСканерНеИнициализованНажатие(Элемент)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СканированиеШтрихкода(Команда)
	
	//Если ПродажиВызовСервера.ПроверитьВозможностьВводаЧека() Тогда
		ОчиститьСообщения();
		
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
		ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
		
		ОткрытьДиалогВводаШтрихкода(ДополнительныеПараметры);
		
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваров(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеПодборТоваров", ЭтотОбъект);
	ПродажиКлиент.ОткрытьПодборТоваров(ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоординаты(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ОбновитьКоординатыМестоположения();
		
	#Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКоординатыНаКарте(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если ЗначениеЗаполнено(ДанныеМестоположения) Тогда
			ГеоКоординаты = ГеолокацияКлиент.ПолучитьКоординатыПоМестоположению(ДанныеМестоположения);
			ПоказатьНаКарте(ГеоКоординаты);
		КонецЕсли;
	#Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказыНаСегодня(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФильтрПериод", "ЗаказыНаСегодня");
	
	ОткрытьФорму("Обработка.ПанельМеню.Форма.Заказы", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказыНаЗавтра(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФильтрПериод", "ЗаказыНаЗавтра");
	
	ОткрытьФорму("Обработка.ПанельМеню.Форма.Заказы", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьПродолжитьОчередьПроцедурПослеОткрытия()
	
	Если ОбновлениеБД Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьБД", 0.1, Истина);
		
	ИначеЕсли ОткрыватьЧтоНового Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ОткрытьЧтоНового", 0.1, Истина);
		
	ИначеЕсли ИспользуетсяАсинхронныйСканер Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
		
	Иначе
		
		ОбновитьМестоположение();
	КонецЕсли;
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() И  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЗадачи() Тогда
		Подключаемый_ПроверитьЗадачи();
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗадачи",1800,Ложь);
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьБД()
	
	ОписаниеОбновлениеБД = Новый ОписаниеОповещения("ПослеОбновленияБД", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ОбновлениеБД",, ЭтаФорма,,,,ОписаниеОбновлениеБД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьЧтоНового()
	
	//ОписаниеЧтоНового = Новый ОписаниеОповещения("ПослеЧтоНового", ЭтотОбъект);
//	ОткрытьФорму("ОбщаяФорма.ЧтоНового",, ЭтаФорма,,,,ОписаниеЧтоНового);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПроверитьЗадачи()
	

		ПолучитьКоличествоЗадачСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоличествоЗадачСервер()
	Если НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		
		ДанныеПоЗадачам = ИнтеграцияТК_ВызовСервера.ПолучитьКоличествоЗадач();
		ВидимостьЗадачи = Ложь;
		ВидимостьИнвентаризация = Ложь;
		ВидимостьВерификация = Ложь;
		ВидимостьТБД = Ложь;
		ВидимостьТНП = Ложь;
        ВидимостьАнкета = Ложь;
		ЗадачОтдельнымСписком = 0;	
		Если ДанныеПоЗадачам.Результат Тогда
			парамВсегоЗадач = Неопределено;
			парамИнвентаризация = Неопределено;
			парамВерификация = Неопределено;
			парамТБД = Неопределено;
			парамТНП = Неопределено;
			парамАнкета = Неопределено;


			ДанныеПоЗадачам.Ответ.Свойство("ВсегоЗадач",парамВсегоЗадач);
			ДанныеПоЗадачам.Ответ.Свойство("Инвентаризация",парамИнвентаризация);
			ДанныеПоЗадачам.Ответ.Свойство("Верификация",парамВерификация);
			ДанныеПоЗадачам.Ответ.Свойство("ТБД",парамТБД);
			ДанныеПоЗадачам.Ответ.Свойство("ТНП",парамТНП);   
			ДанныеПоЗадачам.Ответ.Свойство("Анкета",парамАнкета);

					
			Если парамИнвентаризация <> Неопределено И парамИнвентаризация > 0 Тогда
				ВидимостьИнвентаризация = Истина;
				Элементы.СообщениеИнвентаризации.Заголовок = "Інвентаризація - "+парамИнвентаризация+"шт.";
				ЗадачОтдельнымСписком = ЗадачОтдельнымСписком+парамИнвентаризация;
			КонецЕсли;
			
			Если парамВерификация <> Неопределено И парамВерификация > 0 Тогда
				ВидимостьВерификация = Истина;
				Элементы.СообщениеВерификация.Заголовок = "Верификация - "+парамВерификация+" шт."; 
				ЗадачОтдельнымСписком = ЗадачОтдельнымСписком+парамВерификация;
			КонецЕсли;
			
			Если парамТБД <> Неопределено И парамТБД > 0 Тогда
				ВидимостьТБД = Истина;
				Элементы.СообщениеТБД.Заголовок = "Не продається - "+парамТБД+" шт."; 
				ЗадачОтдельнымСписком = ЗадачОтдельнымСписком+парамТБД;
			КонецЕсли;

			Если парамАнкета <> Неопределено И парамАнкета > 0 Тогда
				ВидимостьАнкета = Истина;
				Элементы.ДекорацияПроверкаСтандартов.Заголовок = "Перевірка стандартів - "+парамАнкета+" шт."; 
				ЗадачОтдельнымСписком = ЗадачОтдельнымСписком+парамАнкета;
			КонецЕсли;  
			Если парамТНП <> Неопределено И парамТНП > 0 Тогда
				ВидимостьТНП = Истина;
				Элементы.СообщениеТНП.Заголовок = "Термін придатності - "+парамТНП+" шт.";  
				ЗадачОтдельнымСписком = ЗадачОтдельнымСписком+парамТНП;
			КонецЕсли;
			
			Если парамВсегоЗадач <> Неопределено И ЗадачОтдельнымСписком<>парамВсегоЗадач Тогда
				ВидимостьЗадачи = Истина;
				Элементы.СообщениеЗадачи.Заголовок = "Завдання на виконання - "+Формат(парамВсегоЗадач-ЗадачОтдельнымСписком,"ЧЦ=3; ЧН=0; ЧГ=")+"шт.";
			КонецЕсли;


		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеЗадачи", "Видимость", ВидимостьЗадачи);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеИнвентаризации", "Видимость", ВидимостьИнвентаризация);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеВерификация", "Видимость", ВидимостьВерификация);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеТБД", "Видимость", ВидимостьТБД);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеТНП", "Видимость", ВидимостьТНП); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПроверкаСтандартов", "Видимость", ВидимостьАнкета);
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ОбновитьВиджеты()
	
	ОбновитьВиджетЗаказы();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТекущегоКассира()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	УстановитьЗаголовокКассир(ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоординатыМестоположения()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Элементы.СтраницыГео.ТекущаяСтраница = Элементы.СтраницаИдетОбновление;
		
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКоординатыМестоположения", 0.1, Истина);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоординатыМестоположения()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ДанныеМестоположения = ГеолокацияКлиент.ОбновитьМестоположение();
		
		Если НЕ ДанныеМестоположения = Неопределено Тогда
			
			Местоположение = ГеолокацияКлиент.ПолучитьПредставлениеМестоположения(ДанныеМестоположения.Координаты);
			
		Иначе
			Местоположение = НСтр("ru = 'Не удалось определить'");
		КонецЕсли;
		
		Элементы.СтраницыГео.ТекущаяСтраница = Элементы.СтраницаКоординаты;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьМестоположение()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ИмяПровайдераГеолокации = ОбщегоНазначенияВызовСервера.ПолучитьПараметрСеанса("ИмяПровайдераГеолокации");
		
		Если ЗначениеЗаполнено(ИмяПровайдераГеолокации) Тогда
			
			ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдераГеолокации);
			
			Если НЕ ДанныеМестоположения = Неопределено Тогда
				Местоположение = ГеолокацияКлиент.ПолучитьПредставлениеМестоположения(ДанныеМестоположения.Координаты);
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМестоположение()
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКоординатыМестоположения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВводаШтрихкода(ДополнительныеПараметры)
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

//&НаСервере
//Процедура ОбновитьИнформациюПоКассовойСмене()
//	//
//	//Продажи.ОбновитьИнформациюПоКассовойСмене(ЭтаФорма);
//	//
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ИнформацияОСмене", "Видимость", КассоваяСменаПросрочена);
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПодборТоваров, СканированиеШтрихкода", "Доступность", НЕ КассоваяСменаПросрочена);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПослеЧтоНового(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЧтоНовогоСервер();
	
	ПроверитьУстановленныеДрайверы();
	
	ОткрыватьЧтоНового = Ложь;
	
	ЗапуститьПродолжитьОчередьПроцедурПослеОткрытия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбновленияБД(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		ОбновлениеБД = Ложь;
		
		ОткрыватьЧтоНового = Истина;
		
		ЗапуститьПродолжитьОчередьПроцедурПослеОткрытия();
		
	Иначе
		ЗавершитьРаботуСистемы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	АвтономныйРежим =  ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() ИЛИ НЕ ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации();

	//НетИнициализации = ПустаяСтрока(ПараметрыСеанса.Подразделение);
	ЕстьНеустановленныеПараметры = Ложь;
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеРежимСинхронизации", "Видимость", Истина);
		ЕстьНеустановленныеПараметры = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеРежимСинхронизации", "Видимость", Ложь);
		
	КонецЕсли;
	
	Если ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации()
		И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыСинхронизации()
		И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеПараметрыСинхронизации", "Видимость", НЕ ЕстьНеустановленныеПараметры);
		ЕстьНеустановленныеПараметры = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеПараметрыСинхронизации", "Видимость", Ложь);
		
	КонецЕсли;
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыУчета() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеПараметрыУчета", "Видимость", НЕ ЕстьНеустановленныеПараметры);
		ЕстьНеустановленныеПараметры = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеПараметрыУчета", "Видимость", Ложь);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
		"СообщениеРаботаНеВозможна",
		"Видимость",
		ЕстьНеустановленныеПараметры);
	//	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СканированиеШтрихкода", "Видимость", 
	//	ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() И НЕ ИспользуетсяАсинхронныйСканер);
	//	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаГео", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация()
	);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКассир", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяУчетПоКассирам()
	);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ВиджетЗаказы", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуютсяЗаказыКлиентов()  И АвтономныйРежим
	);

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПриемТовара", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПриемТовара()  И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСписание", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяСписаниеТоваров()  И НЕ АвтономныйРежим  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПроверкаЦен", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПроверкаЦен() И НЕ АвтономныйРежим  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПеремещение", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПеремещение()  И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИнвентаризация", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяИнвентаризация()  И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЖурналДокументов", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЖурналДокументов()  И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);


	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаВозвратТовара", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяВозвратТовара()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУценка", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяУценкаТовара()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКомлектация", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяУценкаТовара()   И НЕ АвтономныйРежим И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКонтролер", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяКонтролер()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	                                                                         
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИнвентаризацияКом", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяИнвентаризацияКоммисия()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	                                                                         
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПереоценка", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПереоценки()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаМенеджерТЗ", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяМенеджерТЗ()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПриходУход", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПриходУход()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачи", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЗадачи()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаФото", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяФото()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканировка", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяСканировкаТабак()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСклад", "Видимость", 
	ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЛогистика()   И НЕ АвтономныйРежим И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
	ОбновитьПодразделение();
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПодборТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СозданиеИзПодбора", Истина);
		ПараметрыФормы.Вставить("АдресВоВременномХранилище", Результат.АдресВоВременномХранилище);
		
		ОткрытьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборКассира(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ОповещениеВыборКассираНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОповещениеВыборКассираНаСервере(Результат)
	
	УстановитьЗаголовокКассир(Результат);
	
	ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("Кассир", Результат);
	ОбщегоНазначенияВызовСервера.УстановитьПараметрСеанса("ТекущийПользователь", Результат);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокКассир(Пользователь)
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		
		Элементы.ТекущийКассир.Заголовок = Пользователь.Наименование;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "ТекущийКассир");
	Иначе
		
		Элементы.ТекущийКассир.Заголовок = НСтр("ru = 'Кассир не определен'");
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "ТекущийКассир");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПослеЧтоНовогоСервер()
	
	ПараметрыСеанса.ОткрыватьЧтоНового = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляДемоверсии()
	
	Элементы.Демоверсия.Видимость = ЗначениеНастроекПовтИсп.ЭтоДемоверсия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУстановленныеДрайверы()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования()
			= ПредопределенноеЗначение("Перечисление.ТипыУстройствСканирования.ВнешнийСканерШтрихкодов") Тогда
			
			ОборудованиеСканированияШтрихкодов = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеСканированияШтрихкодов();
			
			Если ЗначениеЗаполнено(ОборудованиеСканированияШтрихкодов)
				И ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ОборудованиеСканированияШтрихкодов, "ДрайверОборудования")
					= ПредопределенноеЗначение("Справочник.ДрайверыОборудования.Драйвер1СУстройствоВвода") Тогда
				
				ВерсияДрайвераСканераВМакете = "";
				ВерсияДрайвераСканера = "";
				ДрайверСканераУстановлен = Ложь;
				
				ПодключаемоеОборудованиеКлиент.ПолучитьВерсиюДрайвераОборудования(
					ЭтаФорма,
					ОборудованиеСканированияШтрихкодов,
					ВерсияДрайвераСканера,
					ВерсияДрайвераСканераВМакете,
					ДрайверСканераУстановлен);
				
				Если Лев(ВерсияДрайвераСканера , 5) = "1.0.0" Тогда
					
					Если ДрайверСканераУстановлен И НЕ ВерсияДрайвераСканераВМакете = ВерсияДрайвераСканера Тогда
						
						Оповещение = Новый ОписаниеОповещения("ОбновитьДрайверСканераШтрихкода", ЭтотОбъект);
						
						ТекстПредупреждения = НСтр("ru = 'Для корректной работы сканера штрихкода
						|необходимо обновить драйвер 1С:Устройство ввода.'");
						ПоказатьПредупреждение(Оповещение, ТекстПредупреждения);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДрайверСканераШтрихкода(ДополнительныеПараметры) Экспорт
	
	МенеджерОборудованияКлиент.УстановитьДрайверИзМакета(ПредопределенноеЗначение("Справочник.ДрайверыОборудования.Драйвер1СУстройствоВвода"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетЗаказы()
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуютсяЗаказыКлиентов() Тогда
		
		Возврат;
	КонецЕсли;
	
	//// на сегодня
	//СостояниеЗаказовНаСегодня = Документы.ЗаказКлиента.ПолучитьСостояниеЗаказовНаСегодня();
	//
	//Если СостояниеЗаказовНаСегодня.НеСогласовано = 0 И СостояниеЗаказовНаСегодня.Согласовано = 0 Тогда
	//	
	//	Если СостояниеЗаказовНаСегодня.Выполнено = 0 Тогда
	//		
	//		Элементы.ДекорацияВсеВыполнено.Видимость = Ложь;
	//		Элементы.ДекорацияЗаказовНет.Видимость = Истина;
	//	
	//	Иначе
	//		
	//		Элементы.ДекорацияВсеВыполнено.Видимость = Истина;
	//		Элементы.ДекорацияЗаказовНет.Видимость = Ложь;
	//		
	//	КонецЕсли;
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
	//		"ДекорацияСогласовано, ДекорацияНеСогласовано", "Видимость",
	//		Ложь
	//	);
	//	
	//Иначе
	//	
	//	ШаблонНеСогласовано = НСтр("ru = 'Не согласовано: %НеСогласовано%'");
	//		Элементы.ДекорацияНеСогласовано.Заголовок = СтрЗаменить(ШаблонНеСогласовано, "%НеСогласовано%",
	//		СостояниеЗаказовНаСегодня.НеСогласовано
	//	);
	//
	//	ШаблонСогласовано = НСтр("ru = 'Согласовано: %Согласовано%'");
	//		Элементы.ДекорацияСогласовано.Заголовок = СтрЗаменить(ШаблонСогласовано, "%Согласовано%",
	//			СостояниеЗаказовНаСегодня.Согласовано
	//	);
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
	//		"ДекорацияЗаказовНет, ДекорацияВсеВыполнено", "Видимость",
	//		Ложь
	//	);
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСогласовано, ДекорацияНеСогласовано", "Видимость",
	//		Истина
	//	);
	//
	//КонецЕсли;
	//
	//
	//// на завтра
	//СостояниеЗаказовНаЗавтра = Документы.ЗаказКлиента.ПолучитьСостояниеЗаказовНаЗавтра();
	//
	//Если СостояниеЗаказовНаЗавтра.НеСогласовано = 0 И СостояниеЗаказовНаЗавтра.Согласовано = 0 Тогда
	//	
	//	Если СостояниеЗаказовНаЗавтра.Выполнено = 0 Тогда
	//		
	//		Элементы.ДекорацияВсеВыполненоНаЗавтра.Видимость = Ложь;
	//		Элементы.ДекорацияЗаказовНетНаЗавтра.Видимость = Истина;

	//	Иначе
	//		
	//		Элементы.ДекорацияВсеВыполненоНаЗавтра.Видимость = Истина;
	//		Элементы.ДекорацияЗаказовНетНаЗавтра.Видимость = Ложь;
	//		
	//	КонецЕсли;
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
	//		"ДекорацияСогласованоНаЗавтра, ДекорацияНеСогласованоНаЗавтра",
	//		"Видимость",
	//		Ложь
	//	);

	//Иначе
	//	
	//	ШаблонНеСогласовано = НСтр("ru = 'Не согласовано: %НеСогласовано%'");
	//		Элементы.ДекорацияНеСогласованоНаЗавтра.Заголовок = СтрЗаменить(ШаблонНеСогласовано, "%НеСогласовано%",
	//		СостояниеЗаказовНаЗавтра.НеСогласовано
	//	);
	//	
	//	ШаблонСогласовано = НСтр("ru = 'Согласовано: %Согласовано%'");
	//		Элементы.ДекорацияСогласованоНаЗавтра.Заголовок = СтрЗаменить(ШаблонСогласовано, "%Согласовано%",
	//		СостояниеЗаказовНаЗавтра.Согласовано
	//	);

	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
	//		"ДекорацияЗаказовНетНаЗавтра, ДекорацияВсеВыполненоНаЗавтра",
	//		"Видимость",
	//		Ложь
	//	);
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
	//		"ДекорацияСогласованоНаЗавтра, ДекорацияНеСогласованоНаЗавтра",
	//		"Видимость",
	//		Истина
	//	);
	//
	//КонецЕсли;
	//
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура НастроитьОформлениеПолей()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ЖурналДокументов, ВозвратТовара, ПроверкаЦен,СписаниеТоваров,Перемещение,ПриемТоваров,Инвентаризация,УценкаТоваров",
		"ЦветРамки",
		ЦветаСтиля.ЦветВажного) ;
	
	ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, 
		"СообщениеРежимСинхронизации, СообщениеПараметрыУчета, СообщениеПараметрыСинхронизации");
		
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "ПодсказкаСообщениеПараметрыСинхронизации,
		|ПодсказкаСообщениеРежимСинхронизации, ПодсказкаСообщениеПараметрыУчета,СообщениеРаботаНеВозможна");
	
	ОбщегоНазначения.УстановитьЦветПредупреждающихПолей(ЭтаФорма, "НадписьСканерНеИнициализирован");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИнициализацияСканераПредупреждение", "Видимость",
		ИспользуетсяАсинхронныйСканер И НЕ АсинхронныйСканерИнициализирован
	);
	
КонецПроцедуры

#КонецОбласти



#Область ОриентацияЭкрана

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


#КонецОбласти



&НаКлиенте
Процедура ПроверкаЦен(Команда)
	
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ПроверкаЦен", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


&НаКлиенте
Процедура СписаниеТоваров(Команда)
	ПараметрыФормы = Новый Структура("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Фото(Команда)

	Список = Новый СписокЗначений;
//	Список.Добавить("ФотоСчетчика",,,БиблиотекаКартинок.счетчик);
	Список.Добавить("ФотоОтчета","Фото отчета");
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМеню",ЭтотОбъект,Параметры);
	ПоказатьВыборИзМеню(Оповещение,Список,Элементы.Фото);
//	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМеню(ВыбранныйЭлемент, Параметры) Экспорт
   
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ВыбранныйЭлемент.Значение = "ФотоОтчета" Тогда
		ФайлФото = ОбщегоНазначенияКлиент.СделатьФото();
		Если ФайлФото = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СохранитьФотоНаСервер(ФайлФото)
	Иначе
		ПараметрыФормы = Новый Структура("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ФотоСчетчика"));
		ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаФотоСчетчика", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьФотоНаСервер(ФайлФото)
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("ДоументСервер",Ложь);
	СодержимоеФайла	 = Base64Строка(Новый ДвоичныеДанные(ФайлФото));
	СтруктураДокумента.Вставить("Фото",СодержимоеФайла);
	
	Если  ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,Справочники.ТипыДокументов.Фото);
		Если Не Рез.Результат Тогда
			
			Если ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
				Сообщить("Ошибка отправки фото!");
			Иначе
				Сообщить(Рез.ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриемТоваров(Команда)
   ВыбратьПредварительныйПрием();
КонецПроцедуры

 &НаКлиенте
 Асинх Процедура ВыбратьПредварительныйПрием() 
	 
	 СписокВыбора = Новый СписокЗначений; 
	 СписокВыбора.Добавить("БезакцептныйПрием","Безакцептне приймання");
	// СписокВыбора.Добавить("ПриемТовара","Прийом товару"); 
	
	 Ответ = Ждать ВыбратьИзМенюАсинх(СписокВыбора);   
	 Если Не Ответ = Неопределено Тогда
		 ЗначениеВыбора = Ответ.Значение; 
		 
		 Если ЗначениеВыбора = "ПриемТовара" Тогда
			 ПараметрыФормы = Новый Структура("ТипДокумента,ВидДокумента","Прийом товару","ПриемТовара");
			 ОткрытьФорму("Обработка.ПанельМеню.Форма.Документ",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		 ИначеЕсли ЗначениеВыбора = "БезакцептныйПрием" Тогда 
			 ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПрием"));
			 ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			 
		 КонецЕсли;
		 
	 КонецЕсли;
	 
	  
 КонецПроцедуры


&НаКлиенте
Процедура Розница(Команда)
  ВыбратьПриемТоваров();
КонецПроцедуры


 &НаКлиенте
 Асинх Процедура ВыбратьПриемТоваров() 
	 
	 СписокВыбора = Новый СписокЗначений;
	 СписокВыбора.Добавить("БезакцептныйПриемРЦ","Безакцептне приймання РЦ");
	 СписокВыбора.Добавить("ПриемТоваровРЦ","Прийом товарів РЦ");  
	
	 Ответ = Ждать ВыбратьИзМенюАсинх(СписокВыбора);   
	 Если Не Ответ = Неопределено Тогда
		 ЗначениеВыбора = Ответ.Значение; 
		 
		 Если ЗначениеВыбора = "ПриемТоваровРЦ" Тогда
			 ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемPKG"));
			 ОткрытьФорму("Обработка.Розница.Форма.ПриемТоваровРЦ",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
		 ИначеЕсли ЗначениеВыбора = "БезакцептныйПриемРЦ" Тогда 
			 ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПриемPKG"));
			 ОткрытьФорму("Обработка.Розница.Форма.ПриемТоваровРЦ",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
			 
		 КонецЕсли;
		 
	 КонецЕсли;
	 
	  
 КонецПроцедуры

 
 
 
 
&НаКлиенте
Процедура ЖурналДокументов(Команда)
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Перемещение(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	
	ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация"));

	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентраризацияТБД(Команда)
	
	СписокИНН_ТБД = Новый СписокЗначений;
	СписокИНН_ТБД.Добавить("ТБД","ТБД",Истина);
	СписокИНН_ТБД.Добавить("ТБД_Табак","ТБД Табак",Истина);
	
	ОповещениеТБД = Новый ОписаниеОповещения("ВыборВариантаТБД",ЭтотОбъект,Новый Структура);
	
	ПоказатьВыборИзМеню(ОповещениеТБД,СписокИНН_ТБД);
	
	

КонецПроцедуры

&НаКлиенте
Процедура ВыборВариантаТБД(ВариантТБД,ПараметрыТБД) Экспорт
	
	
	Если ВариантТБД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТипДокумента,ВидДокумента,ДокументUUID",ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД"),ВариантТБД.Значение,Строка(Новый УникальныйИдентификатор()));

	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияКоммисия(Команда)
	ПараметрыФормы = Новый Структура("ТипДокумента,ВидДокумента","Инвентаризация","IN");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.Документ",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


&НаКлиенте
Процедура ВозвратТовара(Команда)
		
	ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияЛок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация"));
	ПараметрыФормы.Вставить("СкладUUID","12334");

	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура УценкаТовара(Команда)
	ПараметрыФормы = Новый Структура("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.Уценка"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура УценкаПересортица(Команда)
	ПараметрыФормы = Новый Структура("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры


&НаКлиенте
Процедура Комплектация(Команда)
	
	ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация"));

	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


&НаКлиенте
Процедура Контролер(Команда)
		
	ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер"));

	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
//	
//	ПараметрыФормы = Новый Структура("", );
//	 ОткрытьФорму("Обработка.Комплектовщик.Форма.ФормаКомплектовщик",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры
 
&НаКлиенте
Процедура Кладовщик(Команда)   
	ВыбратьМенюКладощикАнсинх();
КонецПроцедуры



&НаКлиенте
Процедура СписокЗаданий(Команда)
	ПолучитьКоличествоЗадачСервер();
КонецПроцедуры



#Область Перемещения

&НаКлиенте
Процедура ПолучитьШтрихКодПеремещения()
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код перемещения'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	ДополнительныеПараметры.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров"));
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодПеремещения(ПолученныйШтрихкод)
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Сообщить("Штрих-код не введен! Форма не будет открыта!");
	Иначе			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров"));
		ПараметрыФормы.Вставить("ОснованиеUUID", СокрЛП(ПолученныйШтрихкод));
		ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияПереоценкиНажатие(Элемент)
	ПараметрыФормы = Новый Структура("Переоценки");
	ОткрытьФорму("Обработка.ПанельМеню.Форма.СписокДокументов",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияМенеджерТЗНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Обработка.ПанельМеню.Форма.МенеджерТЗ",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Сканировка(Команда)
	ПараметрыФормы = Новый Структура("", );

	ОткрытьФорму("Обработка.ПанельМеню.Форма.СканированиеТабак",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура Склад(Команда)

   ВыбратьМенюАнсинх();

КонецПроцедуры   

&НаКлиенте
Асинх Процедура ВыбратьМенюАнсинх() 
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("МаршрутныйЛист","Маршрутний лист"); 
	СписокВыбора.Добавить("ВозвратПеремещение","Повернення-переміщення");
	СписокВыбора.Добавить("Сортировка","Сортування"); 
	СписокВыбора.Добавить("Загрузка","Завантаження машини"); 
	СписокВыбора.Добавить("Доставка","PKG у дорозі"); 
	СписокВыбора.Добавить("ЗипПакет","Забрати ЗіпПакет");  
		
	 Ответ = Ждать ВыбратьИзМенюАсинх(СписокВыбора);   
	 Если Не Ответ = Неопределено Тогда
		 ЗначениеВыбора = Ответ.Значение; 
		 
		 Если ЗначениеВыбора = "МаршрутныйЛист" Тогда
			 ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист"));
			 ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		 ИначеЕсли  ЗначениеВыбора = "ВозвратПеремещение" Тогда 
			 ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратПеремещение"));
			 ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		 ИначеЕсли  ЗначениеВыбора = "Загрузка" Тогда 
			 ПараметрыФормы = Новый Структура();
			 ОткрытьФорму("Обработка.Логистика.Форма.Форма",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		 ИначеЕсли  ЗначениеВыбора = "ЗипПакет" Тогда 
			 ПараметрыФормы = Новый Структура();
			 ОткрытьФорму("Обработка.Логистика.Форма.ФормаЗипПакет",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		 ИначеЕсли  ЗначениеВыбора = "Сортировка" Тогда 
			 ПараметрыФормы = Новый Структура();
			 ОткрытьФорму("Обработка.Логистика.Форма.ФормаСортування",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	      ИначеЕсли  ЗначениеВыбора = "Доставка" Тогда 
			 ПараметрыФормы = Новый Структура();
			 ОткрытьФорму("Обработка.Логистика.Форма.ФормаДоставка",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

		 КонецЕсли;
		 
	 КонецЕсли;
	 
	  
 КонецПроцедуры
 
&НаКлиенте
Асинх Процедура ВыбратьМенюКладощикАнсинх() 
	 
	 СписокВыбора = Новый СписокЗначений;
	 СписокВыбора.Добавить("Комплектовщик","Комплектувальник");  
	 СписокВыбора.Добавить("МассовыйОтбор","Масовий відбір");
     СписокВыбора.Добавить("КомплектовщикОтбор","Компл. відбір"); 
	 СписокВыбора.Добавить("НоменклатураВМестоХранение","Товар до місця збер."); 
	 СписокВыбора.Добавить("ПриоритетМестХранения","Порядок місця збер.");   
	 СписокВыбора.Добавить("Аудит1","Аудит ТО");
	 СписокВыбора.Добавить("Аудит2","Аудит PKG");
     	 Ответ = Ждать ВыбратьИзМенюАсинх(СписокВыбора);   
	 Если Не Ответ = Неопределено Тогда
		 ЗначениеВыбора = Ответ.Значение; 
		 
		 ПараметрыФормы = Новый Структура();    
		 ПараметрыФормы.Вставить("ТипДокумента",ЗначениеВыбора);
		 Если ЗначениеВыбора = "Комплектовщик" ИЛИ ЗначениеВыбора = "КомплектовщикОтбор" Тогда
			 ПутьФомы = "Обработка.Комплектовщик.Форма.ФормаКомплектовщик";
		 ИначеЕсли 	ЗначениеВыбора = "МассовыйОтбор" Тогда 
			 ПутьФомы = "ОбщаяФорма.ФормаОчередьСборки";
			// ПутьФомы = "Обработка.Комплектовщик.Форма.ФормаСобратьВолну";
		ИначеЕсли 	ЗначениеВыбора = "Аудит1" Тогда 
			ПутьФомы = "Обработка.Комплектовщик.Форма.Аудит";
			ПараметрыФормы.Вставить("ТипАудита",1);
		ИначеЕсли 	ЗначениеВыбора = "Аудит2" Тогда 
			ПутьФомы = "Обработка.Комплектовщик.Форма.Аудит";
			ПараметрыФормы.Вставить("ТипАудита",2);

		 Иначе
			 ПутьФомы = "Обработка.Комплектовщик.Форма.ФормаКладовщик";
		 КонецЕсли;
		
		 ОткрытьФорму(ПутьФомы,ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		 
	 КонецЕсли;
	  
 КонецПроцедуры
 

 
 
&НаКлиенте
Процедура GoogleОбъектив(Команда)
	//
	//	#Если МобильноеПриложениеКлиент Тогда 
	//	  ЗапускПриложенияМобильногоУстройства
	//	ФайлКартинки = ПолучитьИмяВременногоФайла("jpg");
	//	Запуск = Новый ЗапускПриложенияМобильногоУстройства("android.media.action.IMAGE_CAPTURE");
	//	
	//	Запуск.ДополнительныеДанные.Добавить("output", "file://" + ФайлКартинки, "Uri");
	//	
	//	Рез = Запуск.Запустить(Истина);
	//#КонецЕсли

	
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияПриходУходНажатие(Элемент)
	ПараметрыФормы = Новый Структура("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход"));
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
